In [276]:
import numpy as np
import pandas as pd

In [277]:
ds = pd.Series([12,21,123,32,43,34])
ds

0     12
1     21
2    123
3     32
4     43
5     34
dtype: int64

In [278]:
ds.shape

(6,)

In [279]:
ds.dtype

dtype('int64')

In [280]:
ds.size

6

In [281]:
ds.ndim

1

In [282]:
ds.nbytes

48

In [283]:
ds.item

<bound method IndexOpsMixin.item of 0     12
1     21
2    123
3     32
4     43
5     34
dtype: int64>

In [284]:
ds.items

<bound method Series.items of 0     12
1     21
2    123
3     32
4     43
5     34
dtype: int64>

In [285]:
data = {
    "City": ["New York", "London", "Paris", "Tokyo", "Sydney"],
    "Country": ["USA", "UK", "France", "Japan", "Australia"],
    "Population_Millions": [8.42, 8.98, 2.15, 13.93, 5.31]
}

df = pd.DataFrame(data)

print(df)

       City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31

In [286]:
df

       City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31

In [287]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   City                 5 non-null      object
 1   Country              5 non-null      object
 2   Population_Millions  5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [288]:
df.info

<bound method DataFrame.info of        City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31>

In [289]:
df.size

15

In [290]:
df.loc[5] = ['Tokyo','UK',8.9]

In [291]:
df

       City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31
5     Tokyo         UK                 8.90

In [292]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   City                 6 non-null      object
 1   Country              6 non-null      object
 2   Population_Millions  6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 192.0+ bytes

In [293]:
df.loc[5] = ['Tokyo','UK',8.9]

In [294]:
df.loc[6] = ['Tokyo','UK',np.nan]

In [295]:
df

       City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31
5     Tokyo         UK                 8.90
6     Tokyo         UK                  NaN

In [296]:
df.isna() # returns True if value is null

    City  Country  Population_Millions
0  False    False                False
1  False    False                False
2  False    False                False
3  False    False                False
4  False    False                False
5  False    False                False
6  False    False                 True

In [297]:
df[df.isna()]

  City Country  Population_Millions
0  NaN     NaN                  NaN
1  NaN     NaN                  NaN
2  NaN     NaN                  NaN
3  NaN     NaN                  NaN
4  NaN     NaN                  NaN
5  NaN     NaN                  NaN
6  NaN     NaN                  NaN

In [298]:
df

       City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31
5     Tokyo         UK                 8.90
6     Tokyo         UK                  NaN

In [299]:
df.notna() # return True if those are not null

   City  Country  Population_Millions
0  True     True                 True
1  True     True                 True
2  True     True                 True
3  True     True                 True
4  True     True                 True
5  True     True                 True
6  True     True                False

In [300]:
df[df.notna()]

       City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31
5     Tokyo         UK                 8.90
6     Tokyo         UK                  NaN

In [301]:
df.describe()

       Population_Millions
count             6.000000
mean              7.948333
std               3.963692
min               2.150000
25%               6.087500
50%               8.660000
75%               8.960000
max              13.930000

In [302]:
df.dropna() # remove null values rows in dataset

       City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31
5     Tokyo         UK                 8.90

In [303]:
df.loc[5,'Country']='Japan'
df.dropna()

       City    Country  Population_Millions
0  New York        USA                 8.42
1    London         UK                 8.98
2     Paris     France                 2.15
3     Tokyo      Japan                13.93
4    Sydney  Australia                 5.31
5     Tokyo      Japan                 8.90

In [304]:
import pandas as pd
import numpy as np

data = {
    "City": ["Berlin", np.nan, "Rome", np.nan, "Toronto"],
    "Country": [np.nan, "Spain", "Italy", np.nan, "Canada"],
    "Population_Millions": [3.6, np.nan, 2.8, 9.7, np.nan]
}

df = pd.DataFrame(data)

print(df)

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  NaN
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  NaN

In [305]:
df

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  NaN
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  NaN

In [306]:
df.dropna(subset=['City'])

      City Country  Population_Millions
0   Berlin     NaN                  3.6
2     Rome   Italy                  2.8
4  Toronto  Canada                  NaN

In [307]:
df.dropna(subset=['Country'])

      City Country  Population_Millions
1      NaN   Spain                  NaN
2     Rome   Italy                  2.8
4  Toronto  Canada                  NaN

In [308]:
df.dropna(subset=['Population_Millions'])

     City Country  Population_Millions
0  Berlin     NaN                  3.6
2    Rome   Italy                  2.8
3     NaN     NaN                  9.7

In [309]:
df.dropna(subset=['City','Country','Population_Millions'])

   City Country  Population_Millions
2  Rome   Italy                  2.8

In [310]:
df

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  NaN
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  NaN

In [311]:
df.dropna(subset=['City'],how='any',axis=0)

      City Country  Population_Millions
0   Berlin     NaN                  3.6
2     Rome   Italy                  2.8
4  Toronto  Canada                  NaN

In [312]:
df.dropna(subset=['Country'], how='any', axis=0)

      City Country  Population_Millions
1      NaN   Spain                  NaN
2     Rome   Italy                  2.8
4  Toronto  Canada                  NaN

In [313]:
df.dropna(subset=['Population_Millions'], how='any', axis=0)

     City Country  Population_Millions
0  Berlin     NaN                  3.6
2    Rome   Italy                  2.8
3     NaN     NaN                  9.7

In [314]:
df.dropna(how='any',axis=0)

   City Country  Population_Millions
2  Rome   Italy                  2.8

In [315]:
df.dropna(how='all',axis=1)

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  NaN
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  NaN

In [316]:
df.dropna(how='any',axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [317]:
df

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  NaN
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  NaN

In [318]:
df.dropna(subset=['Population_Millions'])

     City Country  Population_Millions
0  Berlin     NaN                  3.6
2    Rome   Italy                  2.8
3     NaN     NaN                  9.7

In [319]:
df.duplicated() # return duplicate rows or records

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [320]:
data = pd.Series(['python','c','python','java','python','java'])

data

0    python
1         c
2    python
3      java
4    python
5      java
dtype: object

In [321]:
data.value_counts

<bound method IndexOpsMixin.value_counts of 0    python
1         c
2    python
3      java
4    python
5      java
dtype: object>

In [322]:
data.value_counts() # return counts of duplicates

python    3
java      2
c         1
Name: count, dtype: int64

In [323]:
data.value_counts(ascending=True)

c         1
java      2
python    3
Name: count, dtype: int64

In [324]:
data.value_counts(normalize=True)

python    0.500000
java      0.333333
c         0.166667
Name: proportion, dtype: float64

In [325]:
df['Population_Millions'].astype('float')

0    3.6
1    NaN
2    2.8
3    9.7
4    NaN
Name: Population_Millions, dtype: float64

In [326]:
data

0    python
1         c
2    python
3      java
4    python
5      java
dtype: object

In [327]:
df

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  NaN
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  NaN

In [328]:
df.loc[1,'Population_Millions']=2.9

In [329]:
df

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  2.9
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  NaN

In [330]:
df.loc[4,'Population_Millions']=4.9

In [331]:
df

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  2.9
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  4.9

In [396]:
df['Population_Millions'] > 5

0    False
1    False
2    False
3     True
4    False
Name: Population_Millions, dtype: bool

In [398]:
df[df['Population_Millions'] > 5]

  City Country  Population_Millions
3  NaN     NaN                  9.7

In [400]:
df[df['Population_Millions'] < 5]

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  2.9
2     Rome   Italy                  2.8
4  Toronto  Canada                  4.9

In [406]:
df.set_index('City',inplace=True)

In [408]:
df

        Country  Population_Millions
City
Berlin      NaN                  3.6
NaN       Spain                  2.9
Rome      Italy                  2.8
NaN         NaN                  9.7
Toronto  Canada                  4.9

In [410]:
df.reset_index()

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  2.9
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  4.9

In [412]:
df

        Country  Population_Millions
City
Berlin      NaN                  3.6
NaN       Spain                  2.9
Rome      Italy                  2.8
NaN         NaN                  9.7
Toronto  Canada                  4.9

In [414]:
df.reset_index(inplace=True)

In [418]:
df

      City Country  Population_Millions
0   Berlin     NaN                  3.6
1      NaN   Spain                  2.9
2     Rome   Italy                  2.8
3      NaN     NaN                  9.7
4  Toronto  Canada                  4.9

In [432]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [5, 13, 22, 55, 49]
}

df = pd.DataFrame(data)

print(df)

      Name  Age
0    Alice    5
1      Bob   13
2  Charlie   22
3    David   55
4      Eva   49

In [434]:
df

      Name  Age
0    Alice    5
1      Bob   13
2  Charlie   22
3    David   55
4      Eva   49

In [436]:
df['Status'] = df['Age'].apply(lambda x : "Adult" if x >= 18 else "Child")

In [438]:
df

      Name  Age Status
0    Alice    5  Child
1      Bob   13  Child
2  Charlie   22  Adult
3    David   55  Adult
4      Eva   49  Adult

In [440]:
df['Age']

0     5
1    13
2    22
3    55
4    49
Name: Age, dtype: int64

In [442]:
df['Age'].mean()

28.8

In [444]:
df['Age'].median()

22.0

In [446]:
df['Age'].mode()

0     5
1    13
2    22
3    49
4    55
Name: Age, dtype: int64

In [448]:
df['Age'].min()

5

In [450]:
df['Age'].max()

55

In [454]:
df['Age'].count()

5

In [456]:
df['Age'].var()

489.2

In [458]:
df['Age'].std()

22.117866081518805

In [460]:
df.describe()

             Age
count   5.000000
mean   28.800000
std    22.117866
min     5.000000
25%    13.000000
50%    22.000000
75%    49.000000
max    55.000000